{"meta":{"title":"미누블로그","subtitle":"미누캉 삽질 연구소","description":"안뇽하세요","author":"강민우","url":"https://minukang.github.io"},"pages":[{"title":"About me","date":"2017-10-30T05:56:27.000Z","updated":"2017-10-30T06:39:31.372Z","comments":true,"path":"about/index.html","permalink":"https://minukang.github.io/about/index.html","excerpt":"","text":"FrontEnd 개발을 주로 하고 있는 강민우라고 합니다. 현재 2015년 10월 13일부터 2018년 8월 12일까지 국가의 부름을 받아 병역특례업체에 산업기능요원로 재직을 하고 있습니다. 웹을 처음 접한 시기는 2012년 초 입니다. 그 때 부터 지금까지 계속 공부하고 있으며, 앞으로도 끊임없이 공부할거라 예상하고 있습니다. 자랑할 거리는 아니지만 기능경기대회라는 곳에서 웹사이트 디자인/개발 종목을 서울대표로 1등을 한 경험이 있으며, 전국에서 나름 이름을 알린 경력 아닌 경력이 있습니다. 주로 사용하는 언어는 자바스크립트입니다. HTML과 CSS는 올바르고 효율적으로 사용하고자 노력하고 있습니다. 업무상 PHP와 데이터베이스 쿼리를 작성해야할 경우도 생겨 잘하진 못하지만 기본적으로 알고있습니다. 최근에는 파이썬에 관심을 두고 있으며, 파이썬을 활용한 수학 공부랑 병행 중입니다. 참여 프로젝트2013년[미누채팅] (2013년 4월 ~ 2013년 6월) 2014년한국청소년동아리연맹 (2013년 12월 ~ 2014년 1월) 고등학교 실습 수행평가로 실제 기관에 사용되었던 홈페이지입니다. 디자인, 퍼블리싱을 모두 도맡아서 했습니다. XE로 구동하여 관리자가 관리하게 용이하게 만들었습니다. 2015년 레드윙코리아 PC 퍼블리싱 플랙진 PC 퍼블리싱, 모바일 퍼블리싱, 시스템 개발 헬스벨 CTI 연동 개발 사러가 PC 퍼블리싱, 시스템 개발 파타고니아 코리아 PC 퍼블리싱, 모바일 퍼블리싱, 시스템 개발 마켓컬리 PC 퍼블리싱, 모바일 퍼블리싱, 시스템 개발 2016년 라퀴진 모바일 모바일 퍼블리싱 EYEYE PC 퍼블리싱, 모바일 퍼블리싱, 시스템 개발 갈골한과 PC 퍼블리싱 두루약품 사이트 퍼블리싱, 차트 개발 한삼인몰 PC 퍼블리싱, 시스템 개발 일동몰 PC 퍼블리싱, 모바일 퍼블리싱, 시스템 개발 바이레다 인터렉션 개발, 브랜드 퍼블리싱 나트라케어 브랜드 퍼블리싱 농협홍삼 브랜드 퍼블리싱, 시스템 개발 2017년 제이에스티나 PC 퍼블리싱, 모바일 퍼블리싱 사조몰 모바일 퍼블리싱, 시스템 개발 디앤디랩 홈페이지 리뉴얼 반응형 퍼블리싱, 인터렉션 개발 감사합니다."}],"posts":[{"title":"EYEYE","slug":"eyeye","date":"2017-10-30T07:24:30.000Z","updated":"2017-10-30T08:02:09.283Z","comments":true,"path":"2017/10/30/eyeye/","link":"","permalink":"https://minukang.github.io/2017/10/30/eyeye/","excerpt":"","text":"디자이너 계한희의 Directing으로2016 S/S 시즌 론칭하는 ‘EYEYE’는 화려하면서 위트 있는 패턴과 심플한 실루엣으로 믹스 앤 매치가 돋보이는 컨템포러리 여성복 브랜드입니다. 에이치나인에서 컨셉/기획/디자인을 담당하였고, 디앤디랩에서 퍼블리싱/개발을 맡았습니다. 2015년 12월에 시작하여 2016년 1월에 완료하였으며, 큰 특징으로 독창적인 레이아웃과 역동적인 인터렉션, 시시각각 변하는 비주얼 컬러를 꼽을 수 있습니다. EYEYE 디앤디랩 포트폴리오 현재는 다른 리뉴얼 디자인으로 오픈된 상태입니다. 수행목록PC 퍼블리싱 모바일 퍼블리싱 컬렉션 갤러리 게시판 개발 콜라보레이션 룩북 개발 뉴스레터 시스템 개발","categories":[],"tags":[]}]}